БухЭксп/Catalogs/CW_Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заказы</Name>
			<Comment>Заказы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НумерацияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НумерацияЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрефиксЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрефиксыПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрефиксыПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СобытияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СобытияОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПометкаУдаления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеПометкиУдаления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заказы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CW_Заявки")) Тогда 
		
		ДатаСделкиФ 	= ТекущаяДата();
		Клиент 			= ДанныеЗаполнения.Контрагент;
		ТипПеревозки 	= ДанныеЗаполнения.ТипПеревозки;
		Груз 			= ДанныеЗаполнения.Груз;
		Маршрут 		= ДанныеЗаполнения.Маршрут;
		МенеджерПродаж 	= ДанныеЗаполнения.МенеджерПродаж;
		Заявка 			= ДанныеЗаполнения;  
		
		ГруппыПараметровЗаказа.Загрузить(ТипПеревозки.ГруппыПараметровЗаказа.Выгрузить());
		ПараметрыЗаказа.Загрузить(ТипПеревозки.ПараметрыЗаказа.Выгрузить());

		Если ДополнительныеСвойства.Свойство("ЗаполнитьПараметрыПоЗаявке") тогда
			Если ДополнительныеСвойства.ЗаполнитьПараметрыПоЗаявке Тогда
				Для Каждого СтрокаПараметров из ПараметрыЗаказа Цикл
					
					НайденнаяСтрока = Заявка.ПараметрыЗаявки.Найти(СтрокаПараметров.Параметр,"Параметр");
					Если НайденнаяСтрока <> Неопределено Тогда
	                    ЗаполнитьЗначенияСвойств(СтрокаПараметров, НайденнаяСтрока);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ДатаСделки = ТекущаяДата();
		ТипП = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойТипГрузоперевозки");
		Если ТипП <> Неопределено Тогда
			
			// проверяем, что основной тип перевозки доступен пользователю
			ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
			Если (ГруппаПользователя.ОграничениеПоТипамГрузоперевозок) Тогда
				
				МассивДоступныхТипов = Новый Массив;
				Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
					МассивДоступныхТипов.Добавить(Стр.ТипГрузоперевозки);
				КонецЦикла; 
				
				Если (МассивДоступныхТипов.Найти(ТипП) = Неопределено) Тогда
					
					ТипП = Справочники.CW_ТипыПеревозок.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТипПеревозки = ТипП;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТипПеревозки) Тогда
		_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ЭтотОбъект, ТипПеревозки, "ДляЗаказа"); 
		
		СтруктураПараметров = CW_Мониторинг.ПолучитьПредопределенныеПараметры(ТипПеревозки,"ТипПеревозки", Новый УникальныйИдентификатор);
		Если СтруктураПараметров.Код = 0 Тогда
			CW_Мониторинг.ДобавитьПредопределенныеПараметры(ЭтотОбъект,СтруктураПараметров.Параметры);
		КонецЕсли;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(МенеджерПродаж) Тогда
		МенеджерПродаж = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойМенеджерПродаж");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОперативныйМенеджер) Тогда
		ОперативныйМенеджер = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойОперативныйМенеджер");
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// получим новый номер
	Код="";	
	Наименование="";
	ДатаСделкиФ = ТекущаяДата();
	Архив = Ложь;
	
	// ---------------------------------------------------------------------------- 
	Для каждого Стр Из ПараметрыЗаказа Цикл
		
		Если Стр.Параметр.ОчищатьПриКопировании Тогда
			
			Стр.Значение		= Стр.Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			Стр.ЗначениеПлан	= Дата(1,1,1);
			Стр.ЗначениеФакт	= Дата(1,1,1);
			Стр.Примечание		= "";
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	ИнтерактивныйРежим = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ИнтерактивныйРежим",Ложь);
	// --- 
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда 
		УстановитьНовыйКод();
	КонецЕсли;
	
	// номер заказа
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		
		Нумератор = Константы.CW_НумераторЗаказов.Получить();
		Если (ЗначениеЗаполнено(Нумератор)) Тогда
			
			// пытаемся сформировать наименование
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Нумератор);
			// Параметры:
			// ТекущийОбъект - объект заказа
			// Обработка - сама обработка нумерации
			Наименование = ОбработкаОбъект.ПолучитьНовыйНомер(ЭтотОбъект,Нумератор);
			ОбработкаОбъект = Неопределено;
			
		Иначе
			
			Префикс = ПолучитьПрефиксЗаказов();
			
			Номер = РегистрыСведений.CW_НумерацияЗаказов.ПолучитьПоследнийНомерЗаказа(Префикс);
			Номер = Номер + 1;
			
			//Пишем в регистр установлнный номер
			РегистрыСведений.CW_НумерацияЗаказов.ЗаписатьПоследнийНомерЗаказа(Префикс, Номер);
			
			Наименование = СокрЛП(Префикс)+ Формат(Номер,"ЧЦ=6; ЧВН=; ЧГ=0");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	#Область КонтрольЗаполнения
	
	// проверяем заполнение обязательных реквизитов и параметров г/п
	Если (ЗначениеЗаполнено(ТипПеревозки)) Тогда
		
		Если ТипПеревозки.КонтрольЗаполненияКлиентаЗаказ И НЕ ЗначениеЗаполнено(Клиент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен обязательный реквизит ""Клиент""",,"Клиент","Объект",Отказ);
		КонецЕсли; 
		
		Если ТипПеревозки.КонтрольЗаполненияГрузаЗаказ И Константы.CW_Мониторинг_Груз.Получить() И НЕ ЗначениеЗаполнено(Груз) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен обязательный реквизит ""Груз""",,"Груз","Объект",Отказ);
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияМаршрутаЗаказ И Константы.CW_Мониторинг_Маршрут.Получить() И НЕ ЗначениеЗаполнено(Маршрут)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен обязательный реквизит ""Маршрут""",,"Маршрут","Объект",Отказ);
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияОперативногоМенеджераЗаказ И Константы.CW_Мониторинг_ОперативныйМенеджер.Получить() И НЕ ЗначениеЗаполнено(ОперативныйМенеджер)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен обязательный реквизит ""Оперативный менеджер""",,"ОперативныйМенеджер","Объект",Отказ);
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияМенеджераПродажЗаказ И Константы.CW_Мониторинг_МенеджерПродаж.Получить() И НЕ ЗначениеЗаполнено(МенеджерПродаж)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен обязательный реквизит ""Менеджер продаж""",,"МенеджерПродаж","Объект",Отказ);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ИнтерактивныйРежим Тогда
		Отказ = Ложь;
	КонецЕсли;
	
	#КонецОбласти 
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПараметров(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПараметрыТипаПеревозок.Параметр КАК Параметр,
	               |	ВЫБОР
	               |		КОГДА ПараметрыЗаказа.Параметр ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК НаличиеПараметра,
	               |	ВЫБОР
	               |		КОГДА НЕ ПараметрыЗаказа.Параметр ЕСТЬ NULL
	               |			ТОГДА ПараметрыЗаказа.Значение
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ЗначениеПараметра,
	               |	ПараметрыЗаказа.НомерСтроки КАК НомерСтрокиЗаказа
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок.ПараметрыЗаказа КАК ПараметрыТипаПеревозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_Заказы.ПараметрыЗаказа КАК ПараметрыЗаказа
	               |		ПО ПараметрыТипаПеревозок.Параметр = ПараметрыЗаказа.Параметр
	               |			И (ПараметрыЗаказа.Ссылка = &Заказ)
	               |ГДЕ
	               |	ПараметрыТипаПеревозок.Ссылка = &ТипПеревозки
	               |	И ПараметрыТипаПеревозок.КонтрольЗаполнения = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипПеревозки", ТипПеревозки);
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.НаличиеПараметра Тогда
			ШаблонТекста = "В заказе %1 отсутствует параметр, обязательный для заполнения %2";
			ТекстСообщения = СтрШаблон(ШаблонТекста, Ссылка, Выборка.Параметр);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе
			Если Не ЗначениеЗаполнено(Выборка.ЗначениеПараметра) Тогда
				ШаблонТекста = "В заказе %1 не заполнен параметр, обязательный для заполнения %2";
				ТекстСообщения = СтрШаблон(ШаблонТекста, Ссылка, Выборка.Параметр);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьПрефиксЗаказов()
	
	Префикс = СокрЛП(Константы.CW_ПрефиксЗаказов.Получить());
	Если ЗначениеЗаполнено(Префикс) Тогда
		Если Найти(Префикс,"[")<>0 Тогда
			
			НП	= CW_Настройки.ПолучитьНастройкиПользователя();
			Подразделение 			= НП.ПодразделениеПользователя;
			ПрефиксПользователя 	= НП.ПрефиксПользователя;
			ПрефиксПодразделения 	= "";
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	CW_ПрефиксыПодразделений.Префикс КАК Префикс
			|ИЗ
			|	РегистрСведений.CW_ПрефиксыПодразделений КАК CW_ПрефиксыПодразделений
			|ГДЕ
			|	CW_ПрефиксыПодразделений.Подразделение = &Подразделение";
			
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				ПрефиксПодразделения = Выборка.Префикс;
			КонецЕсли;
			
			// делаем замену макросов
			//[ГГГГ] 	- год заказа
			//[ГГ] 		- год заказа
			//[MM] 		- месяц заказа
			//[ПП] 		- префикс подразделения (соответствие задается в отдельном регистре, вызываются из параметров программы через гиперссылку)
			//[ПС] 		- префикс сотрудника (соответствие задается в отдельном регистре, вызываются из параметров программы через гиперссылку)
			Префикс = СтрЗаменить(Префикс,"[ГГГГ]",	Формат(ДатаСделкиФ,"ДФ=yyyy; ДП="));
			Префикс = СтрЗаменить(Префикс,"[ГГ]",	Формат(ДатаСделкиФ,"ДФ=yy; ДП="));
			Префикс = СтрЗаменить(Префикс,"[ММ]",	Формат(ДатаСделкиФ,"ДФ=MM; ДП="));
			Префикс = СтрЗаменить(Префикс,"[ПП]",	ПрефиксПодразделения);
			Префикс = СтрЗаменить(Префикс,"[ПС]",	ПрефиксПользователя);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Префикс;

КонецФункции


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	// ---------------------------------------------------------------------------- 
	// перенесём параметры в регистр параметров
	
	НаборЗаписей = РегистрыСведений.CW_ХарактеристикиЗаказов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Значение = Ссылка;
	НаборЗаписей.Отбор.Заказ.Использование = Истина;
	
	Инетрактивно = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"Инетрактивно",Ложь);
	
	Если Не Инетрактивно Тогда
		ОбновитьДинамическиеПараметры();
	КонецЕсли;
	
	тз = ПараметрыЗаказа.Выгрузить();
	// --- 
	МассивДинамическихПараметров = Неопределено;
	_сф.ДС(ЭтотОбъект).Свойство("МассивДинамическихПараметров",МассивДинамическихПараметров);
	Если (МассивДинамическихПараметров <> Неопределено) Тогда
		МассивУдаления = Новый Массив;
		Для каждого Стр Из тз Цикл
			Если (МассивДинамическихПараметров.Найти(Стр.Параметр)<>Неопределено) Тогда
				МассивУдаления.Добавить(Стр);
			КонецЕсли; 
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(тз,МассивУдаления);	
	КонецЕсли; 
	// --- 
	// добавляем движение по служебному	парамеру,чтобы работал поиск ***
	Нстр = тз.Добавить();
	Нстр.Параметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
	Нстр.Значение = Ложь;
	// --- 
	// пока не используются
	//ДобавитьЗаписиПоДинамическимПараметрам(тз,МассивДинамическихПараметров,_сф.ДС(ЭтотОбъект).СоответствиеСвойствПараметров);
	// --- 
	тз.Колонки.Добавить("Заказ");
	тз.ЗаполнитьЗначения(Ссылка, "Заказ");
	
	НаборЗаписей.Очистить();
	
	//Дополняем данные хранилища значений
	Для Каждого СтрокаПараметров из тз Цикл
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,СтрокаПараметров,,"ХранилищеДанных");
		
		//Новый механизм
		СтрокаНабора.Порядок = СтрокаПараметров.НомерСтроки;
		//Новый механизм
	
		//Записываем данны из хранилизазанчений
		Отбор = Новый Структура("Параметр",СтрокаПараметров.Параметр);
		мСтроки = ПараметрыЗаказа.НайтиСтроки(Отбор);
		//Должна быть одна строка
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0]; 
			СтрокаНабора.ХранилищеДанных = новый ХранилищеЗначения(СтрокаДанных.ХранилищеДанных.Получить());	
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	// ---------------------------------------------------------------------------- 

	
	// проверка совпадения значений реквизитов Заказа и всех ссылающихся на него Грузоперевозок
	// -- выполняется в Форме, ПослеЗаписиНаСервере
	
	//Получаем настройки ползователя
	НастройкиПользователя 				= CW_Настройки.ПолучитьНастройкиПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	АдресНастроекКопирования = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"АдресНастроекКопирования");
	Если (АдресНастроекКопирования <> Неопределено) Тогда
		
		НастройкиКопирования = ПолучитьИзВременногоХранилища(АдресНастроекКопирования);
		// --- 
		ОбъектКопирования = НастройкиКопирования.ОбъектКопирования;
		Если (НастройкиКопирования.Грузоперевозки <> Неопределено) Тогда
			
			Если (_сф.Количество(НастройкиКопирования.Грузоперевозки) <> 0) Тогда
				
				Для каждого ГП Из НастройкиКопирования.Грузоперевозки Цикл
					
					нГП = ГП.Скопировать();
					нГП.Заказ = Ссылка;
					
					Если НастройкиПользователя.ОчищатьПредставлениеГрузоперевозкиПриКопировании Тогда
						нГП.CW_Представление = "";
					КонецЕсли;
					
					Если НастройкиПользователя.УстанавливатьТекущуюДатуГрузоперевозкиПриКопировании Тогда
						нГП.ДатаСделкиФ = ТекущаяДата();
					КонецЕсли;
					
					Если НастройкиКопирования.СпособЗаполненияПараметровГрузоперевозкиПриКопировании = 0 Тогда
						
						МассивУдаляемых = Новый Массив;
						Для каждого СтрПараметр Из нГП.ПараметрыГрузоперевозки Цикл
							Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
							СтрокаПараметра = _сф.к_НайтиСтроку(ГП.ТипПеревозки.ПараметрыГрузоперевозки, Отбор);
							Если (СтрокаПараметра = Неопределено) Тогда
								МассивУдаляемых.Добавить(СтрПараметр);
							КонецЕсли; 
						КонецЦикла;
						_сф.к_УдалитьЭлементыПоМассиву(нГП.ПараметрыГрузоперевозки, МассивУдаляемых);

						нГП.ГруппыПараметровГрузоперевозки.Очистить();
						нГП.ГруппыПараметровГрузоперевозки.Загрузить(ГП.ТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());
						
						// переносим параметры из типа
						Для каждого СтрПараметр Из ГП.ТипПеревозки.ПараметрыГрузоперевозки Цикл
							Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
							СтрокаПараметра = _сф.к_НайтиСтроку(нГП.ПараметрыГрузоперевозки, Отбор);
							Если СтрокаПараметра = Неопределено Тогда
								// добавляем
								Нстр = нГП.ПараметрыГрузоперевозки.Добавить();
								Нстр.Параметр = СтрПараметр.Параметр;
							КонецЕсли; 
						КонецЦикла; 
					КонецЕсли;
					
					нГП.Записать();
					// --- 
					Если (НастройкиКопирования.ВерсииБюджетов <> Неопределено) Тогда
						
						Если (_сф.Количество(НастройкиКопирования.ВерсииБюджетов)<>0) Тогда
							
							Ответ = CW_Бюджетирование.СкопироватьБюджеты(ГП,нГП.Ссылка,НастройкиКопирования.ВерсииБюджетов,НастройкиКопирования.ОчищатьПоказателиБюджетов);
							Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
								
								Отказ = Истина;
								Возврат;
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"АдресНастроекКопирования","");
		
	КонецЕсли; 

	// --- 
	
	CW_Мониторинг.ОбновитьКоличествоГрузоперевозокПоЗаказу(Ссылка); 
	
	// при установке пометки на удаление Заказа - помечать подчинённые грузоперевозки
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("CW_СобытиеЗаписи") Тогда
		Если ЭтотОбъект.ДополнительныеСвойства.CW_СобытиеЗаписи = Перечисления.CW_СобытияОбъектов.ПометкаУдаления Тогда 
			з = Новый Запрос(
				"ВЫБРАТЬ
				|	CW_Грузоперевозки.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
				|ГДЕ
				|	НЕ CW_Грузоперевозки.ПометкаУдаления
				|	И CW_Грузоперевозки.Заказ = &Заказ"
			);
			з.УстановитьПараметр("Заказ", Ссылка);
			рз = з.Выполнить();
			выб = рз.Выбрать();
			Пока выб.Следующий() Цикл
				выб.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзЗаявки") Тогда
		ПроверитьЗаполнениеПараметров(Отказ);                               
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДинамическиеПараметры()
	
	КартаСвойствПараметров 			= CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	ТаблицаДинамическихПараметров 	= CW_Мониторинг.ДинамическиеПараметрыОбъекта(ЭтотОбъект,КартаСвойствПараметров,,ПараметрыЗаказа.Выгрузить());
	
	Для Каждого СтрокаПараметров из ТаблицаДинамическихПараметров Цикл
		
		НайденнаяСтрока = ПараметрыЗаказа.Найти(СтрокаПараметров.Параметр, "Параметр"); 

		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Значение =  СтрокаПараметров.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИерархиюПараметров() Экспорт 
	// --- 
	
	Если (ГруппыПараметровЗаказа.Количество()=0) Тогда
		
		// требуется сформировать группы по текущей иерархии параметров
		
		// добавляем корневой элемент
		КорневаяГруппа = ГруппыПараметровЗаказа.Добавить();
		КорневаяГруппа.Идентификатор = 0;
		КорневаяГруппа.ИдентификаторВедущего=0;
		КорневаяГруппа.Наименование = "Корень";
		КорневаяГруппа.Раскрывать = Истина;
		
		// получаем родителей текущих параметров
		ТЗП = ПараметрыЗаказа.Выгрузить();
		ТЗП.Колонки.Добавить("Код");
		ТЗП.Колонки.Добавить("Родитель");
		ТЗП.Колонки.Добавить("КодРодителя");
		Для каждого Стр Из ТЗП Цикл
			
			Стр.Код = Стр.Параметр.Код;
			Стр.Родитель = Стр.Параметр.Родитель;
			Стр.КодРодителя = Стр.Родитель.Код;
			
		КонецЦикла; 
		
		ТЗР = ТЗП.Скопировать(,"Родитель,КодРодителя");
		ТЗР.Свернуть("Родитель,КодРодителя");
		ТЗР.Сортировать("КодРодителя Возр");
		// --- 
		МассивГруппВерхнегоУровня = Новый Массив;
		ЕстьПустойРодитель = Ложь;
		МассивПараметровБезРодителя = Новый Массив;
		Индекс = 1;
		Для каждого СтрРодитель Из ТЗР Цикл
			
			Отбор = Новый Структура("Родитель",СтрРодитель.Родитель);
			// --- 
			Если (СтрРодитель.Родитель.Пустая()) Тогда
				
				ЕстьПустойРодитель=Истина;
				ТЗПБР = ТЗП.Скопировать(Отбор);
				ТЗПБР.Сортировать("Код Возр");
				Для каждого СтрПБР Из ТЗПБР Цикл
					МассивПараметровБезРодителя.Добавить(Стр.Параметр);
				КонецЦикла;
				
			Иначе
				
				// создаем
				Нстр = ГруппыПараметровЗаказа.Добавить();
				Нстр.Идентификатор = Индекс;
				_сф.Инкремент(Индекс);
				Нстр.ИдентификаторВедущего = 0;
				Нстр.Раскрывать = Истина;
				// --- 
				Нстр.Наименование = Строка(СтрРодитель.Родитель);
				
				// формируем подчиненные
				ТЗПР = ТЗП.Скопировать(Отбор);
				ТЗПР.Сортировать("Код Возр");
				// --- 
				МассивПараметров = ТЗПР.ВыгрузитьКолонку("Параметр");
				Нстр.ИдентификаторыВедомых=ЗначениеВСтрокуВнутр(МассивПараметров);
				
				МассивГруппВерхнегоУровня.Добавить(Нстр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// --- 
		
		МассивЭлементовВерхнегоУровня = Новый Массив;
		Для каждого СтрРодитель Из МассивГруппВерхнегоУровня Цикл
			
			МассивЭлементовВерхнегоУровня.Добавить(СтрРодитель.Идентификатор);
			
		КонецЦикла; 
		Если (МассивПараметровБезРодителя.Количество()<>0) Тогда
			
			Для каждого Параметр Из МассивПараметровБезРодителя Цикл
				
				МассивЭлементовВерхнегоУровня.Добавить(Параметр);
				
			КонецЦикла; 
			
		КонецЕсли; 
		КорневаяГруппа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементовВерхнегоУровня);
		// --- 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры




#КонецЕсли
